<div class="row">
        <div class="col-lg-9">
            <h1>574.Winning Candidate</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table: <code>Candidate</code></p>

<pre>
+-----+---------+
| id  | Name    |
+-----+---------+
| 1   | A       |
| 2   | B       |
| 3   | C       |
| 4   | D       |
| 5   | E       |
+-----+---------+  
</pre>

<p>Table: <code>Vote</code></p>

<pre>
+-----+--------------+
| id  | CandidateId  |
+-----+--------------+
| 1   |     2        |
| 2   |     4        |
| 3   |     3        |
| 4   |     2        |
| 5   |     5        |
+-----+--------------+
id is the auto-increment primary key,
CandidateId is the id appeared in Candidate table.
</pre>

<p>Write a sql to find the name of the winning candidate, the above example will return the winner <code>B</code>.</p>

<pre>
+------+
| Name |
+------+
| B    |
+------+
</pre>

<p><b>Notes:</b></p>

<ol>
	<li>You may assume <b>there is no tie</b>, in other words there will be <b>at most one</b> winning candidate.</li>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("Candidate", engine)

   id Name
0   1    A
1   2    B
2   3    C
3   4    D
4   5    E

In [3]:
pd.read_sql_table("Vote", engine)

   id  CandidateId
0   1            2
1   2            4
2   3            3
3   4            2
4   5            5

In [4]:
## Method 1: Joint first and count
query = '''
SELECT c.Name
FROM Candidate c
LEFT JOIN Vote v
ON c.id = v.CandidateId
GROUP BY c.Name
ORDER BY COUNT(*) DESC
LIMIT 1;
'''
pd.read_sql_query(query, engine)

  Name
0    B

In [5]:
## Method 2: count first and join 
## Could not use IN ([Subquery] LIMIT 1).
query = '''
SELECT c.Name
FROM Candidate c
RIGHT JOIN (SELECT v.CandidateId
            FROM Vote v
            GROUP BY v.CandidateId
            ORDER BY COUNT(*) DESC
            LIMIT 1) temp1
ON c.Id = temp1.CandidateId;
'''
pd.read_sql_query(query, engine)

  Name
0    B

## Note
# Time: O(n^2)
# Space: O(n)